# 1. Поработайте с переменными, создайте несколько, выведите на экран, запросите
# у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.
num_var = 23
print("Значение переменной число: ", num_var)
str_var = "это строка"
print("Значение переменной строка: ", str_var)
bool_var = True
print("Значение переменной истина: ", bool_var)
print()
num_var1 = int(input('Введите целое число: '))
print("Целое число: ", num_var1)
num_var2 = float(input("Введите не целое число: "))
print("Не целое число: ", num_var2)
str_var2 = input('Введите любой текст: ')
print("Строка: ", str_var2)
